/*
  파일명 : "Exam1A_21912193_신대홍"
  프로그램의 목적 및 기본 기능:
	- Cmplx 클래스를 만들어서 복소수 출력하기
  프로그램 작성자 : 신대홍(2022년 9월 23일)
  최종 Update : Version 1.0.0, 2022년 9월 23일(신대홍)
===========================================================================================================
					프로그램 수정/보완 이력
===========================================================================================================
   수정자		   수정일		 버전			     수정/보완내용
-----------------------------------------------------------------------------------------------------------
	신대홍		 2022/09/23		v1.0.0		  최초작성

===========================================================================================================
*/

#include <iostream>?
#include "Cmplx.h"

using namespace std;

int main(void)
{
	Cmplx c1, c2, c3, c4, c5, c6;

	c1.inputCmplx();											// 복소수 c1 입력
	cout << " c1 = "; c1.printCmplx(); cout << endl;			// 복소수 출력

	c2.inputCmplx();											// 복소수 c2 입력
	cout << " c2 = "; c2.printCmplx(); cout << endl;			// 복소수 출력

	c3 = c1.addCmplx(c2);										// c3 = c1 + c2 
	cout << " c3 = c1 + c2 = "; c3.printCmplx(); cout << endl;

	c4 = c1.subCmplx(c2);										// c4 = c1 - c2 
	cout << " c4 = c1 - c2 = "; c4.printCmplx(); cout << endl;	

	c5 = c1.mulCmplx(c2);										// c5 = c1 * c2 
	cout << " c5 = c1 * c2 = "; c5.printCmplx(); cout << endl;

	c6 = c1.divCmplx(c2);										// c6 = c1 / c2 
	cout << " c6 = c1 / c2 = "; c6.printCmplx(); cout << endl;

	return 0;
}